app/Controllers/AdminController.php

    public function index()
    {

        $datos = [];
        $professions = [];
        $levels = [];

if ($this->session->has('user') && $this->session->has('tipo') && $this->session->get('tipo') == 1) {
    $professionModel = new ProfessionModel();
    $professions = $professionModel->findAll();

    $levelModel = new LevelModel();
    $levels = $levelModel->findAll();
---
SELECT *
FROM `users`
SELECT *
FROM `professions`
SELECT *
FROM `levels`