app/Controllers/Home.php

    public function checkUser(){
        $validation = $this->validate([
            'password' => 'required|exact_length[8]|regex_match[/^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[$@$!%*?&])[A-Za-z\d$@$!%*?&]{8,}$/]',
            'fkPhone'  => 'required|numeric|exact_length[10]'
        ]);

        if (!$validation) {
            return redirect()->to(base_url())->withInput()->with('errors', $this->validator->getErrors());
        }

        $fkPhone  = $this->request->getPost('fkPhone');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('fkPhone', $fkPhone)->first();
---
SELECT *
FROM `users`
WHERE `fkPhone` = '7121165751'
 LIMIT 1